branches/jwesselman/RailsERP/app/controllers/accounts_controller.rb

  def index
    @accounts = Account.find(:all)
---
SELECT * FROM "accounts" WHERE ("accounts"."id" = 5) LIMIT 1