branches/jwesselman/RailsERP/app/controllers/adresses_controller.rb

SELECT * FROM "adresses" WHERE ("adresses"."id" = 1)
---
  def show
    @adress = Adress.find(params[:id])

SELECT * FROM "adresses" WHERE ("adresses"."id" = 1)
---
  def edit
    @adress = Adress.find(params[:id])

INSERT INTO "adresses" ("streetnr", "zip", "updated_at", "postcode", "land", "area", "street", "company_id", "created_at") VALUES('7', 51249, '2009-02-26 15:29:23', 'keins', 'Deutschland', 'Bergisch Gladbach', 'Im Hemmerich', NULL, '2009-02-26 15:29:23')
---
  def create
    @adress = Adress.new(params[:adress])

    respond_to do |format|
      if @adress.save

SELECT * FROM "adresses" WHERE ("adresses"."id" = 2)
UPDATE "adresses" SET "updated_at" = '2009-05-14 23:15:55', "streetnr" = 'Suite 3', "city" = 'Independence', "postcode" = '41051', "region" = 'KY', "country" = 'United States of America', "street" = '173 Pelly Road' WHERE "id" = 2
---
  def update
    @adress = Adress.find(params[:id])

    respond_to do |format|
      if @adress.update_attributes(params[:adress])

SELECT * FROM "adresses" WHERE ("adresses"."id" = 1)
DELETE FROM "adresses" WHERE "id" = 1
---
  def destroy
    @adress = Adress.find(params[:id])
    @adress.destroy