branches/jwesselman/RailsERP/app/controllers/dateprios_controller.rb

SELECT * FROM "dateprios" WHERE ("dateprios"."id" = 1)
---
  def show
    @dateprio = Dateprio.find(params[:id])

INSERT INTO "dateprios" ("prio", "updated_at", "created_at") VALUES('empty', '2009-02-27 16:54:42', '2009-02-27 16:54:42')
---
  def create
    @dateprio = Dateprio.new(params[:dateprio])

    respond_to do |format|
      if @dateprio.save