branches/jwesselman/RailsERP/app/controllers/kbcats_controller.rb

SELECT * FROM "kbcats" WHERE ("kbcats"."id" = 1)
---
  def show
    @kbcat = Kbcat.find(params[:id])

INSERT INTO "kbcats" ("name", "updated_at", "created_at") VALUES('empty', '2009-02-27 16:55:13', '2009-02-27 16:55:13')
---
  def create
    @kbcat = Kbcat.new(params[:kbcat])

    respond_to do |format|
      if @kbcat.save