RailsERP/app/controllers/adresses_controller.rb

  def show
    @adress = Adress.find(params[:id])
---
SELECT * FROM "adresses" WHERE ("adresses"."id" = 1)

  def edit
    @adress = Adress.find(params[:id])
---
SELECT * FROM "adresses" WHERE ("adresses"."id" = 1)

  def create
    @adress = Adress.new(params[:adress])

    respond_to do |format|
      if @adress.save
---
INSERT INTO "adresses" ("streetnr", "zip", "updated_at", "postcode", "land", "area", "street", "company_id", "created_at") VALUES('7', 51249, '2009-02-26 15:29:23', 'keins', 'Deutschland', 'Bergisch Gladbach', 'Im Hemmerich', NULL, '2009-02-26 15:29:23')

  def destroy
    @adress = Adress.find(params[:id])
    @adress.destroy
---
SELECT * FROM "adresses" WHERE ("adresses"."id" = 1)
DELETE FROM "adresses" WHERE "id" = 1