RailsERP/app/controllers/companyarts_controller.rb

SELECT * FROM "companyarts" WHERE ("companyarts"."id" = 1)
---
  def show
    @companyart = Companyart.find(params[:id])

INSERT INTO "companyarts" ("name", "updated_at", "created_at") VALUES('Test', '2009-02-26 18:24:11', '2009-02-26 18:24:11')
---
  def create
    @companyart = Companyart.new(params[:companyart])

    respond_to do |format|
      if @companyart.save

SELECT * FROM "companyarts" WHERE ("companyarts"."id" = 1)
DELETE FROM "companyarts" WHERE "id" = 1
---
  def destroy
    @companyart = Companyart.find(params[:id])
    @companyart.destroy

SELECT * FROM "companyarts" WHERE ((COMPANYARTS.NAME LIKE '%FRT%'))
---
  def search
    @companyarts = Companyart.search params[:name]