RailsERP/app/controllers/contacts_controller.rb

SELECT * FROM "contacts" WHERE ("contacts"."id" = 1)
---
  def show
    @contact = Contact.find(params[:id])

SELECT * FROM "contacts" WHERE ("contacts"."id" = 1)
---
  def edit
    @companies= Company.find(:all)
    @contact = Contact.find(params[:id])

INSERT INTO "contacts" ("name", "updated_at", "Info", "lastname", "tel", "mobile", "birthday", "company_id", "position", "email", "created_at") VALUES('empty', '2009-02-27 16:52:26', '', '', '', '', '1930-02-27', 1, '', '', '2009-02-27 16:52:26')
---
  def create
    @contact = Contact.new(params[:contact])

    respond_to do |format|
      if @contact.save

SELECT * FROM "contacts" WHERE ("contacts"."id" = 1)
UPDATE "contacts" SET "Info" = 'empty', "email" = 'empty', "lastname" = 'empty', "position" = 'empty', "birthday" = '1930-02-01', "updated_at" = '2009-02-27 16:56:05' WHERE "id" = 1
---
  def update
    @contact = Contact.find(params[:id])

    respond_to do |format|
      if @contact.update_attributes(params[:contact])