RailsERP/app/controllers/dashboards_controller.rb

  def index
    @dashblogs = Dashblog.find(:all, :conditions => {:published => true} )
---
SELECT * FROM "dashblogs" WHERE ("dashblogs"."published" = 't')