RailsERP/app/controllers/dashblogs_controller.rb

  def show
    @dashblog = Dashblog.find(params[:id])
---
SELECT * FROM "dashblogs" WHERE ("dashblogs"."id" = 1)

  def edit
    @dashblog = Dashblog.find(params[:id])
---
SELECT * FROM "dashblogs" WHERE ("dashblogs"."id" = 1)

  def update
    @dashblog = Dashblog.find(params[:id])

    respond_to do |format|
      if @dashblog.update_attributes(params[:dashblog])
---
SELECT * FROM "dashblogs" WHERE ("dashblogs"."id" = 1)
UPDATE "dashblogs" SET "title" = 'Welcome to RailsERP', "blogtext" = 'You have install it!', "updated_at" = '2009-02-27 16:39:09' WHERE "id" = 1

  def search
    @dashblogs = Dashblog.search params[:name]
---
SELECT * FROM "dashblogs" WHERE ((DASHBLOGS.TITLE LIKE '%WELCOME%' OR DASHBLOGS.BLOGTEXT LIKE '%WELCOME%'))