RailsERP/app/controllers/datearts_controller.rb

SELECT * FROM "datearts" WHERE ("datearts"."id" = 1)
---
  def show
    @dateart = Dateart.find(params[:id])

INSERT INTO "datearts" ("updated_at", "art", "created_at") VALUES('2009-02-27 16:55:06', 'empty', '2009-02-27 16:55:06')
---
  def create
    @dateart = Dateart.new(params[:dateart])

    respond_to do |format|
      if @dateart.save