RailsERP/app/controllers/datestatuses_controller.rb

SELECT * FROM "datestatuses" WHERE ("datestatuses"."id" = 1)
---
  def show
    @datestatus = Datestatus.find(params[:id])

INSERT INTO "datestatuses" ("status", "updated_at", "created_at") VALUES('empty', '2009-02-27 16:54:59', '2009-02-27 16:54:59')
---
  def create
    @datestatus = Datestatus.new(params[:datestatus])

    respond_to do |format|
      if @datestatus.save