RailsERP/app/controllers/folders_controller.rb

SELECT * FROM "folders" WHERE ("folders"."id" = 1)
---
  def show
    @folder = Folder.find(params[:id])

INSERT INTO "folders" ("name", "updated_at", "info", "created_at") VALUES('MAIN', '2009-02-27 16:53:25', '', '2009-02-27 16:53:25')
---
  def create
    @folder = Folder.new(params[:folder])

    respond_to do |format|
      if @folder.save