trunk/RailsERP/app/controllers/companies_controller.rb

SELECT * FROM "companies" WHERE ("companies"."id" = 1)
---
  def show
    @company = Company.find(params[:id])

INSERT INTO "companies" ("name", "updated_at", "companyart_id", "created_at") VALUES('empty', '2009-02-27 16:40:18', 2, '2009-02-27 16:40:18')
---
  def create
    @company = Company.new(params[:company])

    respond_to do |format|
      if @company.save