trunk/RailsERP/app/controllers/dashboards_controller.rb

SELECT * FROM "dashblogs" WHERE ("dashblogs"."published" = 't')
---
  def index
    @dashblogs = Dashblog.find(:all, :conditions => {:published => true} )