trunk/RailsERP/app/controllers/dateprios_controller.rb

  def show
    @dateprio = Dateprio.find(params[:id])
---
SELECT * FROM "dateprios" WHERE ("dateprios"."id" = 1)

  def create
    @dateprio = Dateprio.new(params[:dateprio])

    respond_to do |format|
      if @dateprio.save
---
INSERT INTO "dateprios" ("prio", "updated_at", "created_at") VALUES('empty', '2009-02-27 16:54:42', '2009-02-27 16:54:42')