trunk/RailsERP/app/controllers/kblangs_controller.rb

  def show
    @kblang = Kblang.find(params[:id])
---
SELECT * FROM "kblangs" WHERE ("kblangs"."id" = 1)

  def create
    @kblang = Kblang.new(params[:kblang])

    respond_to do |format|
      if @kblang.save
---
INSERT INTO "kblangs" ("updated_at", "language", "created_at") VALUES('2009-02-27 16:55:22', 'empty', '2009-02-27 16:55:22')