trunk/RailsERP/app/controllers/products_controller.rb

  def create

    @product = Product.new(params[:product])
    @product.imagepath=@product.extension
    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "imagepath", "updated_at", "price", "info", "created_at") VALUES('Test2', 'jpeg', '2009-02-27 21:27:28', 100.0, 'TEST', '2009-02-27 21:27:28')